test = """
                        <dd><a href="21201486.html">第一章 你好，世界</a></dd>
                        <dd><a href="21201487.html">第二章 神奇的制卡</a></dd>
                        <dd><a href="21201575.html">第三章 新卡！</a></dd>
                        <dd><a href="21201576.html">第四章 首发！</a></dd>
                      
                     
                      
                        <dd><a href="21201577.html">第五章 生意火爆</a></dd>
                        <dd><a href="21201578.html">第六章 山寨横行</a></dd>
                        <dd><a href="21201579.html">第七章 心态崩了</a></dd>
                        <dd><a href="21201580.html">第八章 疯狂的热度</a></dd>
                      
                     
                      
                        <dd><a href="21201581.html">第九章 传说中的卡牌</a></dd>
                        <dd><a href="21201582.html">第十章 古老的存在</a></dd>
                        <dd><a href="21201583.html">第十一章 撸猫的代价</a></dd>
                        <dd><a href="21201584.html">第十二章 实习活动</a></dd>
                      
                     
                      
                        <dd><a href="21201585.html">第十三章 诡异的卡面</a></dd>
                        <dd><a href="21201586.html">第十四章 闪电原卡</a></dd>
                        <dd><a href="21201587.html">第十五章 神秘新卡！</a></dd>
                        <dd><a href="21201588.html">第十六章 挖矿少年</a></dd>
                      
                     
                      
                        <dd><a href="21201589.html">第十七章 谣言四起</a></dd>
                        <dd><a href="21201590.html">第十八章 开采区</a></dd>
                        <dd><a href="21201591.html">第十九章 惊变</a></dd>
                        <dd><a href="21213916.html">第二十章 秘境！</a></dd>
                      
                     
                      
                        <dd><a href="21215905.html">第二十一章 浓郁的血腥味</a></dd>
                        <dd><a href="21224808.html">第二十二章（1/2） 出手</a></dd>
                        <dd><a href="21226515.html">第二十二章（2/2） 你知道我的能量盾有多硬吗</a></dd>
                        <dd><a href="21237514.html">第二十三章 传送哪儿了？</a></dd>
                      
                     
                      
                        <dd><a href="21429360.html">第二十四章 这可是你说的！</a></dd>
                        <dd><a href="21429361.html">第二十五章 兄弟你以前到底经历过什么？</a></dd>
                        <dd><a href="21429362.html">第二十六章 一个亿！</a></dd>
                        <dd><a href="21429363.html">第二十七章 陆颜</a></dd>
                      
                     
                      
                        <dd><a href="21429364.html">第二十八章 该死的扶弟魔！</a></dd>
                        <dd><a href="21429365.html">第二十九章 我是你爹！</a></dd>
                        <dd><a href="21429366.html">第三十章 融合！融合！</a></dd>
                        <dd><a href="21542021.html">第三十一章 牛呢？！</a></dd>
                      
                     
                      
                        <dd><a href="21579774.html">第三十二章 霸占两个尿池的男人！</a></dd>
                        <dd><a href="21628797.html">第三十三章 团战可以输！黑锅不能背！</a></dd>
                        <dd><a href="21636811.html">第三十四章 该我了</a></dd>
                        <dd><a href="21672156.html">第三十六章 D加密</a></dd>
                      
                     
                      
                        <dd><a href="21680793.html">第三十七章 能变色了！</a></dd>
                        <dd><a href="21748457.html">第三十八章 生存能力强大</a></dd>
                        <dd><a href="21748458.html">第三十九章 神秘技术！</a></dd>
                        <dd><a href="21748459.html">第四十章 惹不起惹不起！</a></dd>
                      
                     
                      
                        <dd><a href="21776832.html">第四十一章 新的游戏卡！</a></dd>
                        <dd><a href="21776833.html">第四十二章 小孩子还在长身体</a></dd>
                        <dd><a href="21776834.html">第四十三章 第二张游戏卡出炉！</a></dd>
                        <dd><a href="21787271.html">第四十四章 制卡师协会的小风暴</a></dd>
                      
                     
                      
                        <dd><a href="21815375.html">第四十五章 我让你删个够！</a></dd>
                        <dd><a href="21825144.html">第四十六章 被鲲支配的恐惧！</a></dd>
                        <dd><a href="21851474.html">第四十七章 无法山寨！</a></dd>
                        <dd><a href="21856054.html">第四十八章 如此愚蠢的加密方式。</a></dd>
                      
                     
                      
                        <dd><a href="21875649.html">第四十九章 水军不问出处！</a></dd>
                        <dd><a href="21884447.html">第五十章 神秘小礼物</a></dd>
                        <dd><a href="21906429.html">第五十一章 就蹭蹭、不进去</a></dd>
                        <dd><a href="21915307.html">第五十二章 听过氪金修炼者这个职业么？</a></dd>
                      
                     
                      
                        <dd><a href="21937242.html">第五十三章 弯道超车！</a></dd>
                        <dd><a href="21946084.html">第五十四章 坟头那些事儿</a></dd>
                        <dd><a href="21969719.html">第五十五章 干梨娘！！！</a></dd>
                        <dd><a href="21973497.html">第五十六章 初次体验服务的陆鸣</a></dd>
                      
                     
                      
                        <dd><a href="21993854.html">第五十七章 如诗如画张雪瑶</a></dd>
                        <dd><a href="22001231.html">第五十八章 合格的看门人</a></dd>
                        <dd><a href="22015933.html">第五十九章 爱情的滋味</a></dd>
                        <dd><a href="22027633.html">第六十章 延时了解一下？</a></dd>
                      
                     
                      
                        <dd><a href="22027634.html">第六十一章 这是你们逼我的</a></dd>
                        <dd><a href="22027635.html">第六十二章 这什么鬼证词</a></dd>
                        <dd><a href="22027636.html">第六十三章 心慌的王天军</a></dd>
                        <dd><a href="22035993.html">第六十四章 剑落</a></dd>
                      
                     
                      
                        <dd><a href="22052965.html">第六十五章 居然是软的？</a></dd>
                        <dd><a href="22065708.html">第六十六章 你的团长你的团</a></dd>
                        <dd><a href="22089776.html">第六十七章 你是不是对制卡师有什么误解？</a></dd>
                        <dd><a href="22093394.html">第六十八章 坟头卡现世！</a></dd>
                      
                     
                      
                        <dd><a href="22101608.html">第六十九章 诡异的雾气</a></dd>
                        <dd><a href="22103905.html">第七十章 世界的倒影！</a></dd>
                        <dd><a href="22111759.html">第七十一章 愤怒的范泽</a></dd>
                        <dd><a href="22115681.html">第七十二章 我觉得还能抢救一下</a></dd>
                      
                     
                      
                        <dd><a href="22124267.html">第七十三章 斗音一哥的诞生</a></dd>
                        <dd><a href="22126677.html">第七十四章 事情怎么越来越诡异了呢</a></dd>
                        <dd><a href="22133772.html">第七十五章 神秘客人</a></dd>
                        <dd><a href="22184122.html">第七十六章 坟头卡的最强场景！</a></dd>
                      
                     
                      
                        <dd><a href="22204959.html">第七十七章 变绿了，也变强了</a></dd>
                        <dd><a href="22219579.html">第七十八章 这什么鬼名字！</a></dd>
                        <dd><a href="22230350.html">404</a></dd>
                        <dd><a href="22238422.html">第七十九章 大哥，这我台词吧？</a></dd>
                      
                     
                      
                        <dd><a href="22245001.html">第八十章 别以为套个马甲我不认识！</a></dd>
                        <dd><a href="22259376.html">第八十一章 你已经长大了！</a></dd>
                        <dd><a href="22267445.html">第八十二章 黑科技！</a></dd>
                        <dd><a href="22271207.html">第八十三章 师父魅力大呢</a></dd>
                      
                     
                      
                        <dd><a href="22280334.html">第八十四章 一群坑货！</a></dd>
                        <dd><a href="22282582.html">第八十五章 洞察之眼</a></dd>
                        <dd><a href="22290254.html">第八十六章 说好的实力太弱呢？！</a></dd>
                        <dd><a href="22290255.html">第八十七章 最大的区别</a></dd>
                      
                     
                      
                        <dd><a href="22297998.html">第八十八章 财大气粗！</a></dd>
                        <dd><a href="22301777.html">第八十九章 都这么膨胀的么？</a></dd>
                        <dd><a href="22308537.html">第九十章 你要这样剪</a></dd>
                        <dd><a href="22310947.html">第九十一章 稳的一批</a></dd>
                      
                     
                      
                        <dd><a href="22316670.html">第九十二章 发现一只睡着的大佬，不如……</a></dd>
                        <dd><a href="22318091.html">第九十三章 完了，要被灭口</a></dd>
                        <dd><a href="22325688.html">第九十四章 我看着就这么像老实人？</a></dd>
                        <dd><a href="22325689.html">第九十五章 我等你来！</a></dd>
                      
                     
                      
                        <dd><a href="22331691.html">第九十六章 你这是外挂吧？</a></dd>
                        <dd><a href="22334893.html">第九十七章 走，为师带你看金鱼！</a></dd>
                        <dd><a href="22334923.html">第九十八章 四星牛批是吧？</a></dd>
                        <dd><a href="22345937.html">第九十九章 你们考虑过黄雀的感受吗？</a></dd>
                      
                     
                      
                        <dd><a href="22353202.html">第一百章 小晴的抉择</a></dd>
                        <dd><a href="22355581.html">第一百零一章 兄妹VS姐弟！</a></dd>
                        <dd><a href="22363242.html">第一百零二章 你咋不上天呢？！</a></dd>
                        <dd><a href="22366158.html">第一百零三章 人不要脸，天下无敌！</a></dd>
                      
                     
                      
                        <dd><a href="22374693.html">第一百零四章 谁才是主角？</a></dd>
                        <dd><a href="22376942.html">第一百零四章 谁才是主角？</a></dd>
                        <dd><a href="22376943.html">第一百零五章 你且等等，我去撸猫（第一更！）</a></dd>
                        <dd><a href="22380556.html">第一百零六章 圆形生态结构（第二更！）</a></dd>
                      
                     
                      
                        <dd><a href="22380557.html">第一百零七章 降维打击（第三更！）</a></dd>
                        <dd><a href="22380558.html">第一百零八章 如何正确提升战斗力？（第四更！）</a></dd>
                        <dd><a href="22380559.html">第一百零九章 想要变强的话……（第五更！）</a></dd>
                        <dd><a href="22380560.html">五更完毕！求订阅！求月票！</a></dd>
                      
                     
                      
                        <dd><a href="22380561.html">第一百一十章 你们忒欺负人！（第一更！）</a></dd>
                        <dd><a href="22391965.html">第一百一十一章 走、去找他！（第二更）</a></dd>
                        <dd><a href="22391966.html">第一百一十二章 爱好广泛的弟弟（第三更！）</a></dd>
                        <dd><a href="22391967.html">更新完毕！</a></dd>
                      
                     
                      
                        <dd><a href="22391968.html">第一百一十三章 心态炸裂！（第四更！）</a></dd>
                        <dd><a href="22397716.html">第一百一十四章 相当佛系的传承……（第五更！）</a></dd>
                        <dd><a href="22401179.html">第一百一十五章 传承一日游</a></dd>
                        <dd><a href="22408836.html">第一百一十六章 没有传承自己造！</a></dd>
                      
                     
                      
                        <dd><a href="22412027.html">第一百一十七章 你们是我见过最差的一届</a></dd>
                        <dd><a href="22419303.html">第一百一十八章 风雪路上走一遭！</a></dd>
                        <dd><a href="22421663.html">第一百一十九章 意念对决！</a></dd>
                        <dd><a href="22428861.html">第一百二十章 你怎可如此不要脸！</a></dd>
                      
                     
                      
                        <dd><a href="22443575.html">第一百二十一章 姐姐你这样会宠坏人的！</a></dd>
                        <dd><a href="22443576.html">第一百二十二章 考核中会为什么会有这东西！</a></dd>
                        <dd><a href="22449906.html">第一百二十三章 你们姐弟俩干了什么？！</a></dd>
                        <dd><a href="22460701.html">第一百二十四章 ▄█?█●（求月票）</a></dd>
                      
                     
                      
                        <dd><a href="22464202.html">第一百二十五章 你说你是不是贱的慌</a></dd>
                        <dd><a href="22473590.html">第一百二十六章 剑气如林！</a></dd>
                        <dd><a href="22475277.html">第一百二十七章 诸位，请下锅吧</a></dd>
                        <dd><a href="22483082.html">第一百二十八章 天雷勾地火！</a></dd>
                      
                     
                      
                        <dd><a href="22486345.html">第一百二十九章 平生最烦带妹狗！</a></dd>
                        <dd><a href="22496586.html">第一百三十章 第六重山！</a></dd>
                        <dd><a href="22499515.html">第一百三十一章 不可思议的追杀！</a></dd>
                        <dd><a href="22508439.html">第一百三十二章 只要不拆，怎么都好说！</a></dd>
                      
                     
                      
                        <dd><a href="22512582.html">第一百三十三章 传承：惊悚的真相！</a></dd>
                        <dd><a href="22519925.html">第一百三十四章 早晚会被人打死！</a></dd>
                        <dd><a href="22522450.html">第一百三十五章 既然无力反抗……</a></dd>
                        <dd><a href="22531725.html">第一百三十六章 佛系竞争！</a></dd>
                      
                     
                      
                        <dd><a href="22536015.html">第一百三十七章 诸位，请去死吧。</a></dd>
                        <dd><a href="22544041.html">第一百三十八章 这你也能拆？</a></dd>
                        <dd><a href="22546556.html">第一百三十九章 你们是不是忽略了什么</a></dd>
                        <dd><a href="22553475.html">第一百四十章 传承降临！</a></dd>
                      
                     
                      
                        <dd><a href="22558823.html">三分钟延迟……</a></dd>
                        <dd><a href="22558842.html">第一百四十一章 你能不能闭嘴？</a></dd>
                        <dd><a href="22565391.html">第一百四十二章 绝杀！</a></dd>
                        <dd><a href="22576682.html">第一百四十三章 三剑！</a></dd>
                      
                     
                      
                        <dd><a href="22579334.html">第一百四十四章 跪下喊爸爸就对了！</a></dd>
                        <dd><a href="22590068.html">第一百四十五章 你干了什么？！</a></dd>
                        <dd><a href="22592353.html">第一百四十六章 绝代剑修秋书仪！</a></dd>
                        <dd><a href="22601971.html">第一百四十七章 几个意思？！</a></dd>
                      
                     
                      
                        <dd><a href="22601991.html">第一百四十八章 这玩意也能成精？</a></dd>
                        <dd><a href="22613019.html">第一百四十九章 发愤图强制卡师！</a></dd>
                        <dd><a href="22613057.html">第一百五十章 这两个家伙在干吗？</a></dd>
                        <dd><a href="22625561.html">第一百五十一章 大兄弟，你认真的？</a></dd>
                      
                     
                      
                        <dd><a href="22625567.html">第一百五十二章 你这个用词很微妙啊</a></dd>
                        <dd><a href="22633667.html">第一百五十三章 老子招谁惹谁了？</a></dd>
                        <dd><a href="22635544.html">第一百五十四章 新技能get√</a></dd>
                        <dd><a href="22641926.html">第一百五十五章 你那个来了？</a></dd>
                      
                     
                      
                        <dd><a href="22644073.html">第一百五十六章 你这是要上天啊！</a></dd>
                        <dd><a href="22651594.html">第一百五十七章 你们在干嘛？</a></dd>
                        <dd><a href="22652492.html">第一百五十八章 出门在外，总得有一门手艺</a></dd>
                        <dd><a href="22652493.html">第一百五十九章 你们都是信佛的吗？</a></dd>
                      
                     
                      
                        <dd><a href="22664140.html">第一百六十章 你这计划是不是有些问题？</a></dd>
                        <dd><a href="22664141.html">第一百六十一章 我可能被杀熟了？</a></dd>
                        <dd><a href="22673177.html">第一百六十二章 这该死的姐弟情！</a></dd>
                        <dd><a href="22677230.html">第一百六十三章 现在娃娃三观都这么正了？</a></dd>
                      
                     
                      
                        <dd><a href="22692871.html">第一百六十四章 你们这些大佬真怂！</a></dd>
                        <dd><a href="22692960.html">第一百六十五章 你先等等，让我叉会腰</a></dd>
                        <dd><a href="22692961.html">第一百六十六章 没什么是一道剑气解决不了的，如果有……</a></dd>
                        <dd><a href="22692962.html">第一百六十七章 你有没有听过一种从天而降……</a></dd>
                      
                     
                      
                        <dd><a href="22702406.html">第一百六十八章 帮我打一个人！</a></dd>
                        <dd><a href="22705696.html">第一百六十九章 绝地逃生。</a></dd>
                        <dd><a href="22722077.html">第一百七十章 为什么这么眼熟呢？</a></dd>
                        <dd><a href="22731124.html">第一百七十一章 拜托！请接收我的好人卡！</a></dd>
                      
                     
                      
                        <dd><a href="22763586.html">第一百七十二章 神秘黑衣人！</a></dd>
                        <dd><a href="22771711.html">第一百七十三章 小火车过山洞……</a></dd>
                        <dd><a href="22800971.html">第一百七十四章 姐！我要重修！</a></dd>
                        <dd><a href="22860406.html">第一百七十五章 可以看看你的身体吗？</a></dd>
                      
                     
                      
                        <dd><a href="22868325.html">第一百七十六章 你以为刻光盘呢？！</a></dd>
                        <dd><a href="22886377.html">第一百七十七章 你对制卡师是不是有什么误解？</a></dd>
                        <dd><a href="22890338.html">第一百七十八章 疯起来自己人都打！</a></dd>
                        <dd><a href="22918160.html">第一百七十九章 现在小姑娘都玩这么大的吗？</a></dd>
                      
                     
                      
                        <dd><a href="22925051.html">第一百八十章 剑修吴鸿飞之死！</a></dd>
                        <dd><a href="22944525.html">进修技术的作者菌</a></dd>
                        <dd><a href="22969179.html">第一百八十一章 消失的战场！</a></dd>
                        <dd><a href="23005073.html">第一百八十二章 现在纹路都这么羞耻了吗？</a></dd>
                      
                     
                      
                        <dd><a href="23013959.html">进修回归的作者菌~</a></dd>
                        <dd><a href="23034138.html">第一百八十三章 听说重点院校的学生素质都很高……</a></dd>
                        <dd><a href="23038032.html">第一百八十四章 请问你怎么活到现在的？</a></dd>
                        <dd><a href="23042501.html">第一百八十五章 陆哥你变坏了……</a></dd>
                      
                     
                      
                        <dd><a href="23043551.html">第一百八十六章 再打、再打可就漏气了</a></dd>
                        <dd><a href="23051404.html">第一百八十七章 风林队长的骚操作</a></dd>
                        <dd><a href="23051405.html">第一百八十八章 被驱逐的陆鸣</a></dd>
                        <dd><a href="23055191.html">第一百八十九章 望大家多关注我的实力，而不是颜</a></dd>
                      
                     
                      
                        <dd><a href="23055192.html">第一百九十章 水鬼的传说！</a></dd>
                        <dd><a href="23058639.html">第一百九十一章 众所周知……</a></dd>
                        <dd><a href="23059708.html">第一百九十二章 猫哥居然没有蛋蛋？！</a></dd>
                        <dd><a href="23063904.html">第一百九十三章 谁告诉你没洞进不去的？</a></dd>
                      
                     
                      
                        <dd><a href="23066813.html">第一百九十四章 你们一家子都什么人？</a></dd>
                        <dd><a href="23071152.html">第一百九十五章 小白今天早上吐了</a></dd>
                        <dd><a href="23072558.html">第一百九十六章 感觉身体被掏空……</a></dd>
                        <dd><a href="23077102.html">第一百九十七章 你瞒着我把大学生守则背会了？</a></dd>
                      
                     
                      
                        <dd><a href="23083087.html">第一百九十八章 师父，请不要怪大师姐</a></dd>
                        <dd><a href="23083088.html">第一百九十九章 惹不起惹不起~</a></dd>
                        <dd><a href="23088910.html">第二百章 这次真不是我坑你</a></dd>
                        <dd><a href="23088911.html">第二百零一章 你见过绕后开大的核心吗？</a></dd>
                      
                     
                      
                        <dd><a href="23090685.html">第二百零二章 还好猫哥没咬马赛克……</a></dd>
                        <dd><a href="23090686.html">第二百零三章 一看就不是什么正经卡</a></dd>
                        <dd><a href="23099325.html">第二百零四章 慌得一批的陆鸣~</a></dd>
                        <dd><a href="23099326.html">第二百零五章 完惹，爸爸脑子练坏了</a></dd>
                      
                     
                      
                        <dd><a href="23100603.html">第二百零六章 六星杀手的华丽演出</a></dd>
                        <dd><a href="23104498.html">第二百零七章 年久失修，不够耐操</a></dd>
                        <dd><a href="23105725.html">第二百零八章 我是那种人吗？</a></dd>
                        <dd><a href="23111187.html">第二百零九章 一脸懵逼（形容词）的陆鸣</a></dd>
                      
                     
                      
                        <dd><a href="23111788.html">第二百一十章 师父格局竟如此之大！</a></dd>
                        <dd><a href="23115558.html">第二百一十一章 你口味怎么越来越重了？</a></dd>
                        <dd><a href="23116876.html">第二百一十二章 爽到飞起！</a></dd>
                        <dd><a href="23120913.html">第二百一十三章 我辈修者，怎能偷懒？</a></dd>
                      
                     
                      
                        <dd><a href="23121986.html">第二百一十四章 日常被嫌弃的陆鸣</a></dd>
                        <dd><a href="23126197.html">第二百一十五章 你对原卡是不是有什么误解？</a></dd>
                        <dd><a href="23127683.html">第二百一十六章 说好的六星大蛇呢？</a></dd>
                        <dd><a href="23131627.html">第二百一十七章 不仅仅人帅，性格还好！</a></dd>
                      
                     
                      
                        <dd><a href="23133141.html">第二百一十八章 突如其来的诈骗电话！</a></dd>
                        <dd><a href="23142185.html">第二百一十九章 这就是英雄的使命感吧？</a></dd>
                        <dd><a href="23142186.html">第二百二十章 现在的灵体，真是一届不如一届了啊</a></dd>
                        <dd><a href="23142187.html">第二百二十一章 你竟然偷偷做头发去了！</a></dd>
                      
                     
                      
                        <dd><a href="23143447.html">第二百二十二章 断人修行，这可是大仇！</a></dd>
                        <dd><a href="23147869.html">第二百二十三章 一代新卡换旧卡……</a></dd>
                        <dd><a href="23147870.html">第二百二十四章 神秘古传承！！！</a></dd>
                        <dd><a href="23152664.html">第二百二十五章 现在的姐姐啊真的是……</a></dd>
                      
                     
                      
                        <dd><a href="23153982.html">第二百二十六章 哈哈哈哈哈哈老子上天了！</a></dd>
                        <dd><a href="23158664.html">第二百二十七章 你变粉了，也变强了。</a></dd>
                        <dd><a href="23159940.html">第二百二十八章 魅影绝杀！</a></dd>
                        <dd><a href="23164994.html">第二百二十九章 校长，您还不出手？</a></dd>
                      
                     
                      
                        <dd><a href="23166343.html">第二百三十章 我只是一个无辜的制卡师啊</a></dd>
                        <dd><a href="23170880.html">第二百三十一章 陆鸣被抓了</a></dd>
                        <dd><a href="23172588.html">第二百三十二章 来，师父给你看个大宝贝</a></dd>
                        <dd><a href="23176002.html">第二百三十三章 揍你还需要理由？</a></dd>
                      
                     
                      
                        <dd><a href="23177149.html">第二百三十四章 不知道猫哥什么品种……（求月票）</a></dd>
                        <dd><a href="23181221.html">第二百三十五章 哇，师父还懂艺术~</a></dd>
                        <dd><a href="23181222.html">第二百三十六章 放下老王，冲我来！</a></dd>
                        <dd><a href="23181223.html">第二百三十七章 震惊世界！</a></dd>
                      
                     
                      
                        <dd><a href="23181224.html">第二百三十八章 坐等陆鸣爆你们菊花！</a></dd>
                        <dd><a href="23185524.html">祝大家新春愉快</a></dd>
                        <dd><a href="23204887.html">第二百三十九章 嫂子真漂亮！</a></dd>
                        <dd><a href="23204888.html">第二百四十一章 你可以和她深入♂交流一下</a></dd>
                      
                     
                      
                        <dd><a href="23204889.html">第二百四十二章 混账！马赛克没了不算残疾人！</a></dd>
                        <dd><a href="23204890.html">第二百四十三章 让为师检查一下你的身体……素质</a></dd>
                        <dd><a href="23239905.html">第二百四十四章 姑娘，你对颜值是不是有些误解？</a></dd>
                        <dd><a href="23248964.html">第二百四十四章 姑娘，你对颜值是不是有些误解？</a></dd>
                      
                     
                      
                        <dd><a href="23261076.html">第二百四十五章 师父，这不是剑卡师标配么？</a></dd>
                        <dd><a href="23274688.html">第二百四十六章 吴庚已死，有事烧纸。</a></dd>
                        <dd><a href="23292842.html">第二百四十七章 来都来了……</a></dd>
                        <dd><a href="23308278.html">第二百四十八章 你说你选什么不好？</a></dd>
                      
                     
                      
                        <dd><a href="23308279.html">第二百四十九章 远古复读机！</a></dd>
                        <dd><a href="23310079.html">第二百五十章 天赋不够姐姐凑！</a></dd>
                        <dd><a href="23317499.html">第二百五十一章 别人家的卡灵呵呵呵呵</a></dd>
                        <dd><a href="23318987.html">第二百五十二章 你个Hentai！</a></dd>
                      
                     
                      
                        <dd><a href="23325090.html">第二百五十三章 本尊什么尺寸没见过</a></dd>
                        <dd><a href="23326617.html">第二百五十四章 你见过这么咸鱼的主角？</a></dd>
                        <dd><a href="23331414.html">第二百五十五章 暴躁老哥们的爱抚</a></dd>
                        <dd><a href="23332792.html">第二百五十六章 不带这么欺负人的！</a></dd>
                      
                     
                      
                        <dd><a href="23336565.html">第二百五十七章 这小王八蛋在干什么</a></dd>
                        <dd><a href="23337400.html">第二百五十八章 现在凶兽界私生活都这么混乱的吗？</a></dd>
                        <dd><a href="23341096.html">第二百五十九章 雨露均沾</a></dd>
                        <dd><a href="23343887.html">第二百六十章 绽放吧！月光卡！</a></dd>
                      
                     
                      
                        <dd><a href="23351526.html">第二百六十一章 开花！开花！</a></dd>
                        <dd><a href="23359750.html">第二百六十二章 儿子，你对女装感兴趣不？</a></dd>
                        <dd><a href="23359751.html">第二百六十三章 走什么程序，开花就对了！</a></dd>
                        <dd><a href="23361537.html">第二百六十四章 天才们的抉择！</a></dd>
                      
                     
                      
                        <dd><a href="23366267.html">第二百六十五章 突破！突破！</a></dd>
                        <dd><a href="23368017.html">第二百六十六章 兄弟，吃面不？</a></dd>
                        <dd><a href="23375332.html">第二百六十七章 剑卡师培养要从娃娃抓起！</a></dd>
                        <dd><a href="23377611.html">第二百六十八章 你是大师你说了算！</a></dd>
                      
                     
                      
                        <dd><a href="23382144.html">第二百六十九章 我可是看了八十套电视剧的男人！</a></dd>
                        <dd><a href="23384007.html">第二百七十章 一整个行业的偷窥狂魔！</a></dd>
                        <dd><a href="23389375.html">第二百七十一章 你这样会被打死的。</a></dd>
                        <dd><a href="23390977.html">无题</a></dd>
                      
                     
                      
                        <dd><a href="23396152.html">第二百七十二章 来羞辱我啊！</a></dd>
                        <dd><a href="23405317.html">第二百七十三章 爱岗敬业！</a></dd>
                        <dd><a href="23405318.html">第二百七十四章 这两个hentai！</a></dd>
                        <dd><a href="23410017.html">第二百七十五章 关于学校建在坟墓上什么的，抱歉……</a></dd>
                      
                     
                      
                        <dd><a href="23411231.html">第二百七十六章 你被强化了，快去送！</a></dd>
                        <dd><a href="23415744.html">第二百七十七章 哈哈哈哈，居然爆装备了！</a></dd>
                        <dd><a href="23417171.html">第二百七十八章 命中缺苟。</a></dd>
                        <dd><a href="23421825.html">第二百七十九章 双排翻车……</a></dd>
                      
                     
                      
                        <dd><a href="23428454.html">第二百八十章 废什么话，苟就对了。</a></dd>
                        <dd><a href="23432540.html">第二百八十一章 说好的绝世机缘呢？！</a></dd>
                        <dd><a href="23437182.html">第二百八十二章 该死的现充！</a></dd>
                        <dd><a href="23438600.html">第二百七十三章 战六星！！！</a></dd>
                      
                     
                      
                        <dd><a href="23443634.html">第二百七十四章 荒芜卡！！！</a></dd>
                        <dd><a href="23444712.html">第二百八十五章 请问媳妇在哪儿领？</a></dd>
                        <dd><a href="23450178.html">第二百八十六章 是那个被你糟蹋了几次的大姐姐吗？</a></dd>
                        <dd><a href="23451574.html">第二百八十七章 日炸了！！</a></dd>
                      
                     
                      
                        <dd><a href="23462301.html">第二百八十八章 我把你当朋友……你居然……插我</a></dd>
                        <dd><a href="23462302.html">第二百八十九章 笑摸狗头。</a></dd>
                        <dd><a href="23462304.html">第二百九十章 该死的大脸猫！</a></dd>
                        <dd><a href="23467942.html">第二百九十一章 能鞭打灵魂的小皮鞭~</a></dd>
                      
                     
                      
                        <dd><a href="23467943.html">第二百九十二章 不愧是大师弟子！</a></dd>
                        <dd><a href="23473689.html">第二百九十三章 讨厌，小白还在外面呢。</a></dd>
                        <dd><a href="23478889.html">第二百九十四章 该死的妹控！</a></dd>
                        <dd><a href="23480275.html">第二百九十五章 淡定，把自己当coser就好了。</a></dd>
                      
                     
                      
                        <dd><a href="23484816.html">第二百九十六章 你这个姐姐假的吧？</a></dd>
                        <dd><a href="23491381.html">第二百九十七章 剑来。</a></dd>
                        <dd><a href="23497180.html">第二百九十八章 人，总会长大的！</a></dd>
                        <dd><a href="23512261.html">第二百九十九章 长得太帅真的是抱歉了~</a></dd>
                      
                     
                      
                        <dd><a href="23512262.html">第三百章 没错，天赋好就是可以为所欲为！</a></dd>
                        <dd><a href="23520200.html">第三百零一章 没事你们撩拨他干嘛？！</a></dd>
                        <dd><a href="23528876.html">第三百零二章 娘炮才修炼元素师，真男人就该硬肛！</a></dd>
                        <dd><a href="23534893.html">第三百零三章 这个可以教给我吗？</a></dd>
                      
                     
                      
                        <dd><a href="23540786.html">第三百零四章 不愧是千年大派！</a></dd>
                        <dd><a href="23546616.html">第三百零五章 平生最恨作弊狗！</a></dd>
                        <dd><a href="23551731.html">第三百零六章 我是你爹！</a></dd>
                        <dd><a href="23557478.html">第三百零七章 我们来愉快的合体吧！</a></dd>
                      
                     
                      
                        <dd><a href="23563211.html">第三百零八章 埋他！！！</a></dd>
                        <dd><a href="23568861.html">第三百零九章 真正的战士，就是在危险中提升！</a></dd>
                        <dd><a href="23574399.html">第三百一十章 这就是你的极限吗？</a></dd>
                        <dd><a href="23579498.html">第三百一十一章 现在的姐弟关系已经复杂到这种地步了吗？</a></dd>
                      
                     
                      
                        <dd><a href="23593472.html">第三百一十二章 你是吃几何长大的吗？</a></dd>
                        <dd><a href="23593473.html">第三百一十三章 陆鸣，我已经看穿你了。</a></dd>
                        <dd><a href="23593474.html">第三百一十四章 一看就是大户人家的名字！</a></dd>
                        <dd><a href="23598868.html">第三百一十五章 毕竟姐姐也不是什么魔鬼</a></dd>
                      
                     
                      
                        <dd><a href="23606480.html">第三百一十六章 真是糟糕的台词呢</a></dd>
                        <dd><a href="23613219.html">第三百一十七章 如果你被绑架了，就眨眨眼睛</a></dd>
                        <dd><a href="23618945.html">第三百一十八章 被打自闭了……</a></dd>
                        <dd><a href="23624165.html">第三百一十九章 带带系列新卡牌！</a></dd>
                      
                     
                      
                        <dd><a href="23629382.html">第三百二十章 要你何用？！</a></dd>
                        <dd><a href="23635901.html">第三百二十一章 恭喜剑总，喜提高级修炼术！</a></dd>
                        <dd><a href="23641188.html">第三百二十二章 三秒钟的陆鸣。</a></dd>
                        <dd><a href="23646642.html">第三百二十三章 啊，久违的激情。</a></dd>
                      
                     
                      
                        <dd><a href="23657095.html">嘤</a></dd>
                        <dd><a href="23657096.html">第三百二十四章 勤奋的陆鸣！</a></dd>
                        <dd><a href="23664904.html">第三百二十五章 小小白牛批！</a></dd>
                        <dd><a href="23674836.html">第三百二十六章 即将到来的毕业季</a></dd>
                      
                     
                      
                        <dd><a href="23674837.html">停电了，更新可能会晚一些。</a></dd>
                        <dd><a href="23679887.html">第三百二十七章 天星阁之殇！</a></dd>
                        <dd><a href="23685721.html">第三百二十八章 我说这是意外，您信吗？</a></dd>
                        <dd><a href="23697838.html">第三百二十九章 灵体的诞生！</a></dd>
                      
                     
                      
                        <dd><a href="23697839.html">第三百三十章 小白，洗澡这个事情……</a></dd>
                        <dd><a href="23710991.html">第三百三十一章 新东方都开到这里来了？</a></dd>
                        <dd><a href="23731071.html">第三百三十二章 或许是我太过善良吧</a></dd>
                        <dd><a href="23737421.html">第三百三十三章 曾经的你何等优雅……</a></dd>
                      
                     
                      
                        <dd><a href="23745579.html">第三百三十四章 呔！吃我一记口球！</a></dd>
                        <dd><a href="23745580.html">第三百三十五章 均衡！存乎万物之间！</a></dd>
                        <dd><a href="23745581.html">第三百三十六章 性感小小白，在线授课！</a></dd>
                        <dd><a href="23757428.html">第三百三十七章 这样真的不会被打吗？</a></dd>
                      
                     
                      
                        <dd><a href="23763889.html">第三百三十八章 子孙满堂的小白。</a></dd>
                        <dd><a href="23767490.html">第三百三十九章 辣鸡原卡！老子才不学！</a></dd>
                        <dd><a href="23769660.html">翻车了嘤嘤嘤嘤</a></dd>
                        <dd><a href="24151770.html">第三百四十章 不该出现的东西！</a></dd>
                      
                     
                      
                        <dd><a href="24679610.html">第三百四十一章 你听过棺震吗？</a></dd>
                        <dd><a href="25169257.html">第三百四十二章 信不信老子女装给你看？！（弱弱求张月票！）</a></dd>
                        <dd><a href="25478116.html">第三百四十三章 你长大了~</a></dd>
                        <dd><a href="25596789.html">第三百四十四章 我太了解你了。</a></dd>
                      
                     
                      
                        <dd><a href="25678371.html">第三百四十五章 万受无疆张旭坤！</a></dd>
                        <dd><a href="25766484.html">第三百四十六章 被玩坏的薛大佬。</a></dd>
                        <dd><a href="25801864.html">第三百四十七章 啊，久违的文学交流。</a></dd>
                        <dd><a href="25856395.html">第三百四十八章 小小白，如果陆鸣和小白分开，你跟谁？</a></dd>
                      
                     
                      
                        <dd><a href="25896324.html">第三百四十九章 原来是自攻自受！</a></dd>
                        <dd><a href="25967294.html">第三百五十一章 钟楚：请叫我百人斩！</a></dd>
                        <dd><a href="25967297.html">第三百五十一章 钟楚：请叫我百人斩！</a></dd>
                        <dd><a href="26007655.html">第三百五十二章 惊变。</a></dd>
                      
                     
                      
                        <dd><a href="26042411.html">第三百五十三章 小白，要努力变强~</a></dd>
                        <dd><a href="26062203.html">第三百五十四章 愤怒的管理员！</a></dd>
                        <dd><a href="26082945.html">第三百五十五章 敌羞，吾去脱他衣</a></dd>
                        <dd><a href="26082946.html">第三百五十六章 来，让我们给你检查身体</a></dd>
                      
                     
                      
                        <dd><a href="26098794.html">第三百五十七章 你等我。</a></dd>
                        <dd><a href="26109228.html">第三百五十八章 我们剑卡师越级无敌！</a></dd>
                        <dd><a href="26120355.html">第三百五十九章 姐姐牛批！（破音）</a></dd>
                        <dd><a href="26128702.html">第三百六十章 不愧是前辈，实力竟如此丰满！</a></dd>
                      
                     
                      
                        <dd><a href="26277593.html">第三百六十一章 我们协会可不是什么阿猫阿狗……</a></dd>
                        <dd><a href="26277594.html">第三百六十二章 颜值不够师父凑！</a></dd>
                        <dd><a href="26345464.html">第三百六十三章 想出头，就得有些骚操作。</a></dd>
                        <dd><a href="26403476.html">第三百六十四章 我不是针对你，我是说在坐的各位都是……</a></dd>
                      
                     
                      
                        <dd><a href="26423036.html">第三百六十五章 你们姐弟是魔鬼么？</a></dd>
                        <dd><a href="26441913.html">第三百六十六章 陆鸣，下来受死！</a></dd>
                        <dd><a href="26451236.html">第三百六十七章 原来老二是这个意思？</a></dd>
                        <dd><a href="26461764.html">第三百六十八章 你们已经是底线了。</a></dd>
                      
                     
                      
                        <dd><a href="26496753.html">第三百六十九章 你可真是个小机灵鬼</a></dd>
                        <dd><a href="26496754.html">第三百七十章 到现在还没交过女朋友吧？</a></dd>
                        <dd><a href="26496755.html">第三百七十一章 我说的是陆鸣帅……</a></dd>
                        <dd><a href="26496756.html">第三百七十二章 十二分的全熟。</a></dd>
                      
                     
                      
                        <dd><a href="26508212.html">第三百七十三章 胜负已定！</a></dd>
                        <dd><a href="26518275.html">第三百七十四章 姐姐终于同意我和师父的事了！</a></dd>
                        <dd><a href="26524896.html">第三百七十五章 新人培训活动</a></dd>
                        <dd><a href="26540943.html">第三百七十六章 师父，您这样会被打的</a></dd>
                      
                     
                      
                        <dd><a href="26633000.html">第三百七十七章 狗生无望……</a></dd>
                        <dd><a href="26633002.html">第三百七十八章 哭！都给我哭！</a></dd>
                        <dd><a href="26633004.html">第三百七十九章 高考招生计划。</a></dd>
                        <dd><a href="26633006.html">第三百八十章 呵呵，原来是同行。</a></dd>
                      
                     
                      
                        <dd><a href="26633008.html">第三百八十一章 哈哈哈，居然有这么笨的人。</a></dd>
                        <dd><a href="26633010.html">第三百八十二章 我高考30分我得意过吗？！</a></dd>
                        <dd><a href="26633014.html">第三百八十三章 第一阶段毕业的弟子们！</a></dd>
                        <dd><a href="26633016.html">第三百八十四章 蝗虫一样的能量战士协会！</a></dd>
                      
                     
                      
                        <dd><a href="26633017.html">第三百八十五章 师生恋是不被允许的！！！</a></dd>
                        <dd><a href="26633018.html">第三百八十六章 新弟子上门！</a></dd>
                        <dd><a href="26633019.html">第三百八十七章 李二狗的梦想！</a></dd>
                        <dd><a href="26633020.html">第三百八十八章 *****</a></dd>
                      
                     
                      
                        <dd><a href="26633021.html">第三百九十章 天都市沦陷</a></dd>
                        <dd><a href="26633022.html">第三百九十一章 还特么能这样？？？</a></dd>
                        <dd><a href="26633023.html">第三百九十二章 豪华别墅！拎包入住！</a></dd>
                        <dd><a href="26633024.html">第三百九十三章 突如其来的战争！</a></dd>
                      
                     
                      
                        &nbsp;
                     
                      
                        <dd><a href="26712255.html">第三百九十四章 偷人者人恒偷之</a></dd>
                        <dd><a href="26733046.html">第三百九十五章 你知道作死两个字怎么写吗？</a></dd>
                        <dd><a href="26747189.html">第三百九十六章 师父。</a></dd>
                        <dd><a href="26760940.html">第三百九十七章 老子又不是摇摇乐！</a></dd>
                      
                     
                      
                        <dd><a href="26760942.html">第三百九十八章 讨厌呢~</a></dd>
                        <dd><a href="26783773.html">第三百九十九章 炸死笔灵！</a></dd>
                        <dd><a href="26792323.html">第四百章 低调的标题</a></dd>
                        <dd><a href="26799662.html">第四百零一章 鬼火卡首秀翻车</a></dd>
                      
                     
                      
                        <dd><a href="26806907.html">第四百零二章 与陆无关</a></dd>
                        <dd><a href="26813803.html">第四百零三章 跪下，叫爸爸！</a></dd>
                        <dd><a href="26821551.html">第四百零五章 能有陆鸣十分之一优秀就好了。</a></dd>
                        <dd><a href="26828224.html">第四百零六章 你看不起我？！</a></dd>
                      
                     
                      
                        <dd><a href="26834351.html">第四百零七章 秋前辈的心里辅导♂♂♂</a></dd>
                        <dd><a href="26843967.html">第四百零八章 不许骑原卡呢！！！</a></dd>
                        <dd><a href="26850082.html">第四百零九章 挨最毒的打，爆最热的点！我是宣传部长我自豪！</a></dd>
                        <dd><a href="26866734.html">第四百一十章 原来这个世界真有如此惊艳绝才集美貌与才华于一身的男子。</a></dd>
                      
                     
                      
                        <dd><a href="26866743.html">第四百一十一章 世间少有的狠人！</a></dd>
                        <dd><a href="26874287.html">第四百一十二章 小小剑：雾草，原来我这么牛批？！</a></dd>
                        <dd><a href="26882667.html">第四百一十三章 船新的卡牌！</a></dd>
                        <dd><a href="26891410.html">第四百一十四章 对粉色街道保持好奇心是一个男人最基本的尊重。</a></dd>
                      
                     
                      
                        <dd><a href="26912928.html">第四百一十五章 你们这个肮脏的协会！</a></dd>
                        <dd><a href="26922516.html">第四百一十六章 只有你们会长我才这么牛批！[得意] [得意][得意]</a></dd>
                        <dd><a href="26928840.html">第四百一十七章 诡异的新卡牌！</a></dd>
                        <dd><a href="26935290.html">第四百一十九章 剑卡师协会阶段性汇报总结。</a></dd>
                      
                     
                      
                        <dd><a href="26948713.html">第四百二十章 你知道什么绝代剑修吗？</a></dd>
                        <dd><a href="26954136.html">第四百二十一章 #我为秋前辈做数据#</a></dd>
                        <dd><a href="26960230.html">第四百二十二章 远古神剑！</a></dd>
                        <dd><a href="26973541.html">第四百二十三章 你若辱骂他，他就拆你家！</a></dd>
                      
                     
                      
                        <dd><a href="26988239.html">第四百二十四章 低调的标题X2。</a></dd>
                        <dd><a href="26994192.html">第四百二十五章 神贱复苏！</a></dd>
                        <dd><a href="27001931.html">第四百二十六章 不管你是不是太监猫，以后你就是我猫爸爸！</a></dd>
                        <dd><a href="27010851.html">第四百二十七章 呵，人类。</a></dd>
                      
                     
                      
                        <dd><a href="27018680.html">第四百二十八章 呵，牛头。</a></dd>
                        <dd><a href="27025101.html">第四百二十九章 爸爸，我错了。</a></dd>
                        <dd><a href="27032170.html">第四百三十章 低调的标题X3</a></dd>
                        <dd><a href="27038091.html">第四百三十一章 近在咫尺的九星！！！</a></dd>
                      
                     
                      
                        <dd><a href="27044510.html">第四百三十二章 总感觉哪里不太对劲。</a></dd>
                        <dd><a href="27051370.html">第四百三十三章 众所周知，保洁阿姨也是一种隐藏职业。</a></dd>
                        <dd><a href="27057246.html">第四百三十四章 我、我不想吃香菜啊</a></dd>
                        <dd><a href="27062428.html">第四百三十五章 少女周韵。</a></dd>
                      
                     
                      
                        <dd><a href="27066824.html">第四百三十六章 少年，你是什么魔鬼？</a></dd>
                        <dd><a href="27081351.html">第四百三十七章 低调的标题X4</a></dd>
                        <dd><a href="27081352.html">第四百三十八章 低调的七月七。</a></dd>
                        <dd><a href="27085979.html">第四百三十九章 陆鸣这孩子，受了委屈从来不说。</a></dd>
                      
                     
                      
                        <dd><a href="27089584.html">第四百四十章 男人都是大猪蹄子！</a></dd>
                        <dd><a href="27092954.html">第四百四十一章 校花的贴身保镖（狗头保命）</a></dd>
                        <dd><a href="27097269.html">第四百四十二章 只要你将来有一个孩子姓杨就可以。</a></dd>
                        <dd><a href="27101557.html">第四百四十三章 放心，师父，我懂。</a></dd>
                      
                     
                      
                        <dd><a href="27101985.html">第四百四十四章 狗策划！快加强职业！（盟主加更！）</a></dd>
                        <dd><a href="27105161.html">第四百四十五章 你就能不能换个职业怼？！</a></dd>
                        <dd><a href="27109526.html">第四百四十六章 你醒啦。</a></dd>
                        
                      
                     
"""

list1 = test.split('.html">第')
list2 = []
for i in list1:
    if '<dd><a href="' in i :
        list3 = i.split('<dd><a href="')
        list2.append(list3[-1])
print(list2)